Repository: OSLL/code-plagiarism
Catalog: locales/translations/*/LC_MESSAGES/codeplag.po
Languages: ru

source: You cannot specify the same value multiple times. You provided '{values}'.
ru: Нельзя указать одно и тоже значение несколько раз. Было указано '{values}'.

source: Enter MongoDB password:
ru: Введите пароль от MongoDB:

source: Directory '{path}' not found or not a directory.
ru: Каталог '{path}' не найден или он не является каталогом.

source: File '{path}' not found or not a file.
ru: Файл '{path}' не найден или он не является файлом.

source: Modifies and shows static settings of the '{util_name}' util.
ru: Изменение и отображение статических настроек утилиты '{util_name}'.

source: Settings commands of the '{util_name}' util.
ru: Команды настройки утилиты '{util_name}'.

source: Manage the '{util_name}' util settings.
ru: Модификация настроек утилиты '{util_name}'.

source: Path to the environment file with GitHub access token.
ru: Путь к файлу окружения с токеном доступа к GitHub.

source: If defined, then saves reports about suspect works into provided file or directory. If directory by provided path doesn't exists than saves reports as a file.
ru: Если значение определено, то сохраняет отчеты о подозрительных работах в указанный файл или папку. Если каталог по указанному пути не существует, то сохраняет отчеты в файл.

source: Show progress of searching plagiarism.
ru: Показывать прогресс выполнения поиска схожих работ.

source: When provided '0' show all check works results in the stdout. When provided '1' show only new found check works results in the stdout. When provided '2' do not show check works result in the stdout.
ru: При заданном значении '0' показывать в stdout все результаты проверок. При заданном значении '1' показывать в stdout только новые найденные результаты проверок. При заданном значении '2' не показывать результаты проверок в stdout.

source: Threshold of analyzer which classifies two work as same. If this number is too large, such as 99, then completely matching jobs will be found. Otherwise, if this number is small, such as 50, then all work with minimal similarity will be found.
ru: Порог анализатора, который классифицирует две работы как одинаковые. Если это число будет слишком велико, например, 99, то будут найдены практически полностью схожие работы. В противном случае, если это число будет невелико, например, 50, то будут найдены все работы с минимальным сходством.

source: The maximum depth of the AST structure which play role in calculations.
ru: Максимальная глубина структуры AST, учитываемая при структурном сравнении.

source: The length of N-grams generated to calculate the Jakkar coefficient. A long length of N-grams reduces the Jakkar coefficient because there are fewer equal sequences of two works.
ru: Длина N-грамм, сгенерированных для вычисления коэффициента Жаккара. Большая длина N-грамм уменьшает коэффициент Жаккара, поскольку количество одинаковых последовательностей из двух работ становится меньше.

source: The language of help messages, generated reports, errors.
ru: Язык справочных сообщений, сгенерированных отчетов, ошибок.

source: Sets the threshold for the '{util_name}' util loggers'. Logging messages that are less severe than the level will be ignored.
ru: Устанавливает пороговое значение логирования утилиты '{util_name}'. Сообщения, которые менее серьезны, чем это значение, будут игнорироваться.

source: The maximum number of processes that can be used to compare works.
ru: Максимальное количество процессов, которые можно задействовать для сравнения работ.

source: The host address of the MongoDB server.
ru: Адрес хоста сервера MongoDB.

source: The port of the MongoDB.
ru: Порт MongoDB.

source: The username for connecting to the MongoDB server.
ru: Имя пользователя для подключения к серверу MongoDB.

source: The password for connecting to the MongoDB server. If empty - hide input.
ru: Пароль для подключения к серверу MongoDB. Если пуст - скрытый ввод.

source: Show the '{util_name}' util settings.
ru: Показать настройки утилиты '{util_name}'.

source: Start searching similar works.
ru: Начать поиск схожих работ.

source: Absolute or relative path to a local directories with project files.
ru: Абсолютный или относительный путь к локальным папкам с файлами проекта.

source: Absolute or relative path to files on a computer.
ru: Абсолютный или относительный путь к файлам на компьютере.

source: Choose one of the following modes of searching plagiarism. The 'many_to_many' mode may require more free memory.
ru: Выберите один из следующих режимов поиска схожих работ. Режим 'many_to_many' может требовать больше свободной памяти.

source: A regular expression for filtering checked works by name. Used with options 'directories', 'github-user' and 'github-project-folders'.
ru: Регулярное выражение для фильтрации проверяемых работ по имени. Используется с аргументами 'directories', 'github-user' или 'github-project-folders'.

source: Ignore the threshold when checking of works.
ru: Игнорировать пороговое значение при проверке работ.

source: Extension responsible for the analyzed programming language.
ru: Расширение проверяемых работ.

source: Searching in all branches.
ru: Поиск по всем веткам.

source: A regular expression to filter searching repositories on GitHub.
ru: Регулярное выражение для фильтрации искомых репозиториев на GitHub.

source: URL to file in a GitHub repository.
ru: URL до файла в репозитории на GitHub.

source: GitHub organization/user name.
ru: Название организации или имя пользователя на GitHub.

source: URL to a GitHub project folder.
ru: URL до какой-либо папки проекта на GitHub.

source: Handling generated by the {util_name} reports as creating html report file or show it on console.
ru: Обработка отчетов, сгенерированных с помощью {util_name}, в виде создания файла отчета в формате html или отображения его на консоли.

source: Report commands of the '{util_name}' util.
ru: Команды для работы с отчётами утилиты '{util_name}'.

source: Generate general report from created some time ago report files.
ru: Создание общего отчёта из созданных ранее файлов отчётов.

source: Path to save generated report. If it's a directory, then create a file in it.
ru: Путь для сохранения созданного отчёта. Если передан путь до папки, то создаёт отчёт в ней.

source: Type of the created report file.
ru: Тип создаваемого файла отчёта.

source: Path to first compared works. Can be path to directory or URL to the project folder.
ru: Путь к первым сравниваемым файлам. Это может быть путь к директории или URL к папке проекта.

source: Path to second compared works. Can be path to directory or URL to the project folder.
ru: Путь ко вторым сравниваемым файлам. Это может быть путь к директории или URL к папке проекта.

source: Program help to find similar parts of source codes for the different languages.
ru: Программа помогает находить схожие части исходных кодов для разных языков программирования.

source: Print current version number and exit.
ru: Выводит текущую версию программы.

source: Commands help.
ru: Справка по командам.

source: No command is provided; please choose one from the available (--help).
ru: Ни одна из команд не выбрана, пожалуйста, выбери одну из доступных команд (--help).

source: There is nothing to modify; please provide at least one argument.
ru: Нечего модифицировать, пожалуйста, выберите один из параметров для модификации.

source: The'repo-regexp' option requires the provided 'github-user' option.
ru: Аргумент 'repo-regexp' требует заданного параметра 'github-user'.

source: The'path-regexp' option requires the provided 'directories', 'github-user', or 'github-project-folder' options.
ru: Аргумент 'path-regexp' требует заданного параметра 'directories', 'github-user' или 'github-project-folder'.

source: All paths must be provided.
ru: Необходимо указать все корневые пути или не указывать ни одного.

source: Invalid report type.
ru: Некорректный тип отчёта.

source: Comparative report
ru: Сравнительный отчёт

source: Check results
ru: Результаты проверки

source: Summary information
ru: Сводка по работам

source: Path
ru: Путь

source: Total similarity
ru: Общая схожесть, %

source: General information
ru: Общая информация

source: Last modification date
ru: Дата последней модификации

source: Check date
ru: Дата проверки

source: Metrics information
ru: Информация по метрикам

source: Type of compare
ru: Тип сравнения

source: Metric
ru: Метрика

source: Value
ru: Значение

source: Fast
ru: Быстрый

source: Jaccard Coefficient
ru: Коэффициент Жаккара

source: Similarity of operators
ru: Схожесть операторов

source: Similarity of keywords
ru: Схожесть ключевых слов

source: Similarity of literals
ru: Схожеcть литералов

source: Weighted average by fast metrics
ru: Средневзвешенное по быстрым метрикам

source: Structure
ru: Структурный

source: Similarity of structures
ru: Схожесть структур

source: Similar parts of the second program relative to the first
ru: Схожие части второй программы относительно первой

source: Part of the first program
ru: Часть первой программ

source: Part of the second program
ru: Часть второй программы

source: Similarity
ru: Схожесть

source: Similar parts of the first program relative to the second
ru: Схожие части первой программы относительно второй

source: Verification results
ru: Результаты проверки

source: The path to the file being checked
ru: Путь до проверяемого файла

source: Total maximum compliance, %
ru: Суммарное максимальное соответствие, %

source: Similar parts of the programs
ru: Схожие части программ

source: The name of a similar file
ru: Имя схожего файла

source: Part of the file that is being checked
ru: Часть проверяемого файла

source: Part of a similar file
ru: Часть схожего файла
